Revit 2026 API

# FamilyManager Class

---

The family manager object to manage the family types and parameters in family document.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFamilyManager

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyManager : APIObject
```
```vb
Public Class FamilyManager
	Inherits APIObject
```
```cpp
public ref class FamilyManager : public APIObject
```
```fsharp
type FamilyManager =
    class
        inherit APIObject
    end
```

The FamilyManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentType | The current family type. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | ParameterBuiltInParameter | Obtains the parameter of this type with a given parameter id. |
|  | ParameterDefinition | Obtains the parameter of this type with a given definition. |
|  | ParameterGuid | Obtains the parameter of this type with a given GUID for a shared parameter. |
|  | ParameterString | Obtains the parameter of this type with a given name. |
|  | Parameters | All family parameters in this family. |
|  | Types | All family types in the family. |

|  | Name | Description |
| --- | --- | --- |
|  | AddParameter(ExternalDefinition, ForgeTypeId, Boolean) | Add a new shared parameter to the family. |
|  | AddParameter(String, ForgeTypeId, Category, Boolean) | Add a new family type parameter to control the type of a nested family within another family. |
|  | AddParameter(String, ForgeTypeId, ForgeTypeId, Boolean) | Add a new family parameter with a given name. |
|  | AssociateElementParameterToFamilyParameter | Associates or disassociates the element parameter to an existing family parameter. |
|  | CanElementParameterBeAssociated | Indicates if this element parameter can be associated with a family parameter. |
|  | DeleteCurrentType | Remove the current family type. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAssociatedFamilyParameter | Gets the associated family parameter of an element parameter. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetParameter | Obtains the family parameter with the given built-in parameter identifier. |
|  | GetParameters | Gets the parameters associated to family types in order. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsParameterLockable | For Conceptual Mass and Curtain Panel families, indicate whether the specified parameter can be locked. |
|  | IsParameterLocked | For Conceptual Mass and Curtain Panel families, indicate whether the specified dimension-driving parameter is locked. |
|  | IsUserAssignableParameterGroup | Checks if the given parameter group can be assigned to new parameters. |
|  | MakeInstance | Set the family parameter as an instance parameter. |
|  | MakeNonReporting | Set the reporting family parameter as a regular/driving parameter. |
|  | MakeReporting | Set the family parameter as a reporting parameter. |
|  | MakeType | Set the family parameter as a type parameter. |
|  | NewType | Add a new family type with a given name and makes it be the current type. |
|  | RemoveParameter | Remove an existing family parameter from the family. |
|  | RenameCurrentType | Rename the current family type. |
|  | RenameParameter | Rename a family parameter. |
|  | ReorderParameters |  |
|  | ReplaceParameter(FamilyParameter, ExternalDefinition, ForgeTypeId, Boolean) | Replace a family parameter with a shared parameter. |
|  | ReplaceParameter(FamilyParameter, String, ForgeTypeId, Boolean) | Replace a shared family parameter with a new non-shared family parameter. |
|  | Set(FamilyParameter, ElementId) | Set the ElementId value of a family parameter of the current family type. |
|  | Set(FamilyParameter, Double) | Set the double value of a family parameter of the current family type. |
|  | Set(FamilyParameter, Int32) | Set the integer value of a family parameter of the current family type. |
|  | Set(FamilyParameter, String) | Set the string value of a family parameter of the current family type. |
|  | SetDescription | Set the description for an existing family parameter. The description will be used as tooltip in the Revit UI including in the properties palette. |
|  | SetFormula | Set the formula of a family parameter. |
|  | SetParameterLocked | For Conceptual Mass and Curtain Panel families, lock or unlock a dimension-driving parameter. |
|  | SetValueString | Set the string value of a family parameter of the current family type. |
|  | SortParameters | Sorts the family parameters according to the desired sort order. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace